Revit 2026 API

# ImageExportOptionsZoom Property

---

The value for Zoom (as a percentage). Used only when ZoomType is Zoom.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Zoom { get; set; }
```
```vb
Public Property Zoom As Integer
	Get
	Set
```
```cpp
public:
property int Zoom {
	int get ();
	void set (int value);
}
```
```fsharp
member Zoom : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The Zoom value is outside the permitted range. |

The default is 50.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace